Tekla Open API Reference for Tekla Structures 2025
AnalysisPartLoadingProperties Class
 The AnalysisPartLoadingProperties class contains information related to analysis part loading properties.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisPartLoadingProperties
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisPartLoadingProperties
Public NotInheritable Class AnalysisPartLoadingProperties
The AnalysisPartLoadingProperties type exposes the following members.
Constructors
Name | Description
AnalysisPartLoadingProperties
Initializes a new instance of the AnalysisPartLoadingProperties class
Top
Properties
Name | Description
LoadGenerationAutoCreateFixedSupports
 Indicates whether fixed supports are automatically created.
LoadGenerationGroupIdentifierFactors
 The load generation group identifier factors.
LoadGenerationPartNames
 The load generation part names.
LoadGenerationPartNamesInclude
 Indicates whether part names are included in the load generation.
LoadGenerationSelfWeight
 Indicates whether the selfweight load is generated.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace